//独立的数据文件
var newsData = [
    {
        newsid: 0,
        time: "5/23 16:15",
        title: "岁月不老，一世倾城",
        flag: true,
        articletext: "时光的流逝，如缓缓流过的小溪，再怎样努力也无法逆转它的方向；这个午后，我站在开满丁香花的树下目送你走远，紫色的小花散发着幽幽的暗香，我忍不住深吸一口气，连同这阳光的明艳一起咽下，又忍不住轻笑，你温情厚重的影子仿佛还在，余温尚存，这里因你目光的停留而变成一道让人心生欢快的风景！",
        like_start: "12",
        like_num: "30",
        articleimg: "../images/sub1.png",
        authoricon: "../images/head1.png",
        authoricon1: "../../images/head1.png",
        headimg: "../../images/sub1.png",
        author: "gavin",
        dataTime: "5/24 2:17",
        detail: "时光的流逝，如缓缓流过的小溪，再怎样努力也无法逆转它的方向；这个午后，我站在开满丁香花的树下目送你走远，紫色的小花散发着幽幽的暗香，我忍不住深吸一口气，连同这阳光的明艳一起咽下，又忍不住轻笑，你温情厚重的影子仿佛还在，余温尚存，这里因你目光的停留而变成一道让人心生欢快的风景！已经习惯了在每次重逢用微笑当做第一声问候，那句“好久不见”像一道彩虹，搭起了五彩斑斓的光阴脉络，在一低头的眉眼里，是拽也拽不住的思潮奔涌。你说每年的这个季节，心最难安顿下来，因内心依然保留了一席之地的温存，这情谊也从不曾变淡。四周是侃侃而谈的喧哗，我们诉说着交织的过往，尘烟渐渐漫过清澈的眼眸，变的柔和温婉。一别经年，我们依旧如野花野草一样任性的生长，时而暗淡无颜色，时而又闪烁着光芒，岁月积淀的安稳和沉着，让你的笑更加自若和有温度；我们都明白，生活不只有诗和远方，还有琐碎潦草的日常，或许正是懂得生活中的真意，才让一切饱满的仿佛生命从未有过沧桑、苦痛、别离和不堪。想必我们都是怀着不惊不扰的心意赴一场约，我们含笑对坐，交换着别来无恙，一切安好的人与事。原以为日子还很长很长，只一刹那已是海角天涯；还好，我们曾留给彼此最纯粹的那抹笑靥，支撑了内心的踏实与清明，这些年以一颗温柔心，对峙着岁月如刀刻般的冷冽，从不忘感念彼此的好，也感恩岁月的馈赠。我们不必费力说明心思，不经意的一个对视，已是了然，于是感谢我们都还在，在最初的时光里。历经半生纷纷扰扰，谁没有失意过？谁不曾被伤害过？却欣慰我们还是一派少年纯真的简单模样，也都活的更像自己。这透彻，竟源自心底不舍放弃的底色，初心从不曾淡漠啊，是的，永不！一切花事最后总会飘落归泥，却为此生留存了不能磨灭的香息，彼此的经过，让这抹香愈加恒久；即便转身离开的那一刻，依旧什么都不会变。这弥香不散，这岁月就不会老，我们只是这样不紧不慢的走下去，就已很好！是的，最终还是会走、会离开，那一刻，回头看到你温和的脸庞，迎着你温暖相望的目光，豁然明了，这样浅浅的相守多美。山河故人，告别才是多余，用心中最柔软的部分去赶赴一番美意，不惊艳亦不会惊心！或许，我们还是会牵念，一颗心风尘仆仆，穿透时空的距离，跨越万水千山而来，在某个不需邀约的夜晚，心事微醉着怀念起开在一朵花里的往事；我们也会驻足在风里回首流连，那年轻的模样，那还温热的心思。但是，我们终究不会留下誓言，分合或聚散，就如花落尘香在，那个曾经温暖过彼此的人，像一切绝美的事物，带不走就学会放下，不挽留，不执念；我带着明媚如初的笑靥，陪你走了一程山水一程明月，还有什么能比这惦念更美！我在这束光阴中，安享着心里的芬芳，感怀相遇相知彼此的厚待。我们都喜欢这种相守的姿态：默然相伴，寂静喜欢；一份清澈如水的缘，流淌成醉人的清喜绵长。这一季心仪的风景已开在心里，那城池清宁幽婉，花语清淡凛然，即便有了淡淡的忧伤，亦是一种别样的风情。最好的岁月里，有懂我的灵魂相伴，如良玉般温暖剔透，这份长情早已超脱新欢或旧爱，倾心与倾慕，它会一直安然的生长在那里，像春天花会开，秋天果实会丰满，一季又一季的循环，我们不会忘，这是我们永远不变的少年底色，不老的山河岁月！",
        comment: [
            {
                conmmentimg: "../../images/head1.png",
                conmmentname: "小夏同学",
                conmmenttext: "你适可而止，抽身而退的样子特别特别帅，简直帅到没朋友！"
            },
            {
                conmmentimg: "../../images/head2.png",
                conmmentname: "十月同学",
                conmmenttext: "我们终究不会留下誓言，分合或聚散，就如花落尘香在，那个曾经温暖过彼此的人，像一切绝美的事物，带不走就学会放下，不挽留，不执念；我带着明媚如初的笑靥，陪你走了一程山水一程明月，还有什么能比这惦念更美！我在这束光阴中，安享着心里的芬芳，感怀相遇相知彼此的厚待"
            }
        ],
        music: {
            url: "http://iwen.wiki/sxtstu/music/iamyou.mp3",
            title: "i am you",
            coverImg: ""
        }
    },
    {
        newsid: 1,
        time: "5/24 2:17",
        title: "时光不老，我们不散",
        flag: true,
        articletext: "天空不知何时划过一颗颗流星，飞向同一个星球，宛如我们来自不同的城市，但却相聚在这小小的房子里。生命是个漫长又遥远的过程，经历着陌生和熟悉，冷漠和温暖。时光消磨着岁月的痕迹追着青春的步伐，我们哼着歌回忆往昔;我们读着书品味诗意;",
        like_start: "100",
        like_num: "44",
        articleimg: "../images/sub2.png",
        authoricon: "../images/head2.png",
        authoricon1: "../../images/head2.png",
        headimg: "../../images/sub2.png",
        author: "gavin",
        dataTime: "5/24 2:17",
        detail: "天空不知何时划过一颗颗流星，飞向同一个星球，宛如我们来自不同的城市，但却相聚在这小小的房子里。生命是个漫长又遥远的过程，经历着陌生和熟悉，冷漠和温暖。时光消磨着岁月的痕迹，追着青春的步伐，我们哼着歌回忆往昔;我们读着书品味诗意;我们说着笑讲述自己;我们谈着天细数日子。梦里花开，清风飘过，桌上的书页正谱写动人的旋律。白色的墙是你我最坚实的港湾，小小的房子里住着我们的记忆，灯光的照明，你牵着我的手，陪我走过无数个日日夜夜，陪我穿梭于春夏秋冬，陪我走过生命的旅程。又是花开的季节，到处都是风车在转，记得那个时候你说日子好长，你说青春不变梦想满星辰，你说记忆犹存沧海桑田，你说时光不老我们不散，其实那年，我们追着风筝奔跑的时候，时光就早已悄悄溜走。阳光下，一行人一排影子，还有一串相伴的小脚丫。",
        comment: [
            {
                conmmentimg: "../../images/head2.png",
                conmmentname: "七月",
                conmmenttext: "天空不知何时划过一颗颗流星，飞向同一个星球"
            },
            {
                conmmentimg: "../../images/head1.png",
                conmmentname: "章章",
                conmmenttext: "我们说着笑讲述自己;我们谈着天细数日子"
            },
            {
                conmmentimg: "../../images/head2.png",
                conmmentname: "陈承一",
                conmmenttext: "阳光下，一行人一排影子，还有一串相伴的小脚丫。"
            }
        ],
        music: {
            url: "http://iwen.wiki/sxtstu/music/sgbl.mp3",
            title: "时光不老,我们不散",
            coverImg: ""
        }
    },
    {
        newsid: 2,
        time: "6/13 3:15",
        title: "美丽的风景",
        flag: true,
        articletext: "美丽的大自然，是一道风景;天真烂漫的童真，是一道风景;助人为乐，是一道风景;辛勤的身影，一道风景;埋头苦学，是一道风景;父母无微不至的关爱，也是一道风景。一道风景都令我们陶醉，为我们的生活增光增彩。",
        like_start: "40",
        like_num: "67",
        articleimg: "../images/banner1.jpg",
        authoricon: "../images/head1.png",
        authoricon1: "../../images/head1.png",
        headimg: "../../images/banner1.jpg",
        author: "gavin",
        dataTime: "6/13 3:15",
        detail: "美丽的大自然，是一道风景;天真烂漫的童真，是一道风景;助人为乐，是一道风景;辛勤的身影，一道风景;埋头苦学，是一道风景;父母无微不至的关爱，也是一道风景。一道风景都令我们陶醉，为我们的生活增光增彩。美丽的大自然，是一道波澜壮阔的风景。从阿尔卑斯山上无暇的白雪，到爱琴海上明媚的阳光，从西伯利亚的广袤无垠的森林，到得克萨斯州一望无际的平原。构成一幅幅美丽的画卷，在美丽大自然上展开。孩子们拥有的童真是一道天真烂漫的风景。我仿佛看到了鲁国的儿童搭了一座沙城挡住了孔子的去路，还天真地问是、是应该“车让城还是城让车”孔子被迫绕道而行，还拜这个小孩为师。这道风景不是永恒的，但这道风景一直被千百年来无数的人们所赞美、所追求。助人为乐是一道无私的风景，这道风景不如同转瞬即逝的童真，这道风景一直被善良的人们所保留，所传诵。雷锋，一名普通的中国士兵，而他却在有限的生命中，帮助无数个有困难的人，解决他人无数个难题。但他的生命实在太短暂了，老天没有眷顾这个善良的人。但老天却把他的精神留给了无数的人。老师辛勤的身影一道耀眼的风景，“春蚕到死丝方尽，蜡炬成灰泪始干”许多老师从自己在年轻力壮候开始力工作，一直到白发苍苍，一直到躺在病榻上回想到自己一生奉献给国家的栋梁。每一道风景都是我们为之倾倒，为之陶醉：每一道风景都可能会让我伫足思考许久，将来我会成为哪种风景?",
        comment: [
            {
                conmmentimg: "../../images/head1.png",
                conmmentname: "景甜",
                conmmenttext: "美丽的大自然，是一道风景"
            },
            {
                conmmentimg: "../../images/head2.png",
                conmmentname: "长城",
                conmmenttext: "我们终究不会留下誓言，分合或聚散，就如花落尘香在，那个曾经温暖过彼此的人，像一切绝美的事物，带不走就学会放下，不挽留，不执念；我带着明媚如初的笑靥，陪你走了一程山水一程明月，还有什么能比这惦念更美！我在这束光阴中，安享着心里的芬芳，感怀相遇相知彼此的厚待"
            }
        ],
        music: {
            url: "http://iwen.wiki/sxtstu/music/iamyou.mp3",
            title: "i am you",
            coverImg: ""
        }
    },
    {
        newsid: 3,
        time: "10/23 3:15",
        title: "卡里克索桥",
        flag: true,
        articletext: "位于北爱尔兰，是北爱尔兰最具吸引力的景点之一。索桥悬挂在距海面80英尺的高度，两端连接在陡峭的悬崖。漫步在狭窄的摇晃的桥板上，令人胆战心惊。如果碰到一个艳阳高照的好天气，还能欣赏到美丽的风景。（这座桥虽然看起来不长，但也极具挑战性）",
        like_start: "400",
        like_num: "670",
        articleimg: "../images/banner2.jpg",
        authoricon: "../images/head1.png",
        authoricon1: "../../images/head1.png",
        headimg: "../../images/banner2.jpg",
        author: "gavin",
        dataTime: "10/23 3:15",
        detail: "【卡里克索桥】位于北爱尔兰，是北爱尔兰最具吸引力的景点之一。索桥悬挂在距海面80英尺的高度，两端连接在陡峭的悬崖。漫步在狭窄的摇晃的桥板上，令人胆战心惊。如果碰到一个艳阳高照的好天气，还能欣赏到美丽的风景。（这座桥虽然看起来不长，但也极具挑战性）艾-彼得山吊桥】位于乌克兰克里米亚半岛，您若想俯瞰雅尔塔的绝美风景，就必须鼓起勇气踏上这座吊桥，站在最高峰，可俯瞰克里米亚南部海岸。【祖谷藤蔓桥】这座位于日本祖谷川上近千年的蔓桥高15米，长45米，宽2米，是日本三大奇桥之一，被列为日本有形文化财。【胡赛尼吊桥(Hussaini Bridge)】位于巴基斯坦，它是一座由参差的木条构成的绳桥，号称“全世界最危险的吊桥”！这座吊桥不但长，而且脚踏板也因为老旧而支离破碎，恐怖的是旁边还有早就噎垮掉的旧胡赛尼吊桥，让你走得心惊胆跳，深怕自己脚下的木头等下就像隔壁的老桥一般掉进湖里。要想越过巴基斯坦山脉中的罕萨河，就必须走这座胡赛尼吊桥。【绳桥】位于秘鲁库斯科有这样一座绳桥，这是世界上最古老的绳吊桥之一，每年当地人都会对这座桥进行修缮。",
        comment: [
            {
                conmmentimg: "../../images/head1.png",
                conmmentname: "巧巧",
                conmmenttext: "我爱卡里克索桥"
            },
            {
                conmmentimg: "../../images/head2.png",
                conmmentname: "小乔",
                conmmenttext: "我们终究不会留下誓言，分合或聚散，就如花落尘香在，那个曾经温暖过彼此的人，像一切绝美的事物，带不走就学会放下，不挽留，不执念；我带着明媚如初的笑靥，陪你走了一程山水一程明月，还有什么能比这惦念更美！我在这束光阴中，安享着心里的芬芳，感怀相遇相知彼此的厚待"
            }
        ],
        music: {
            url: "http://iwen.wiki/sxtstu/music/iamyou.mp3",
            title: "i am you",
            coverImg: ""
        }
    },
    {
        newsid: 4,
        time: "10/23 3:15",
        title: "浪漫飞行",
        flag: true,
        articletext: "天高云淡，碧空如洗。冬日的暖阳柔和的沐浴着忙碌的机场。此时，海南航空公司的一架空客340从南京轰鸣着冲向了蓝天。",
        like_start: "100",
        like_num: "170",
        articleimg: "../images/banner3.jpg",
        authoricon: "../images/head1.png",
        authoricon1: "../../images/head1.png",
        headimg: "../../images/banner3.jpg",
        author: "gavin",
        dataTime: "10/23 3:15",
        detail: "天高云淡，碧空如洗。冬日的暖阳柔和的沐浴着忙碌的机场。此时，海南航空公司的一架空客340从南京轰鸣着冲向了蓝天。头等商务舱里，许愿眯着眼在沉思。他知道，这次海口之行，对他的人生将起到一个翻天覆地的变化。他打开公文包，拿出那份重要的合同，又仔细的阅读起来。看到合同中那1个亿的标的，不惑之年的他，脸上露出不易察觉的窃喜。飞机在云雾中平稳的穿行。望着窗外那如絮的白云，许愿想到了自己的过往人生。从农村考上国内名牌大学，然后回乡创办了自己的农业科技公司，几十年的光阴，他把自己扎根在生养他的土地中，辛勤的耕耘着，公司也在不断的发展壮大。许愿太看重事业了，以至于把自己的终身大事都耽搁了。",
        comment: [
            {
                conmmentimg: "../../images/head1.png",
                conmmentname: "巧巧",
                conmmenttext: "我爱卡里克索桥"
            },
            {
                conmmentimg: "../../images/head2.png",
                conmmentname: "小乔",
                conmmenttext: "我们终究不会留下誓言，分合或聚散，就如花落尘香在，那个曾经温暖过彼此的人，像一切绝美的事物，带不走就学会放下，不挽留，不执念；我带着明媚如初的笑靥，陪你走了一程山水一程明月，还有什么能比这惦念更美！我在这束光阴中，安享着心里的芬芳，感怀相遇相知彼此的厚待"
            }
        ],
        music: {
            url: "http://iwen.wiki/sxtstu/music/iamyou.mp3",
            title: "i am you",
            coverImg: ""
        }
    }
]

//模块化导出
module.exports = {
    newsData: newsData
}